// 3.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.

//Записать условие, которое будет истиной
//когда точка с координатами х,у попадает
//в заштрихованные области плоскостей.

#include <iostream>
#include <conio.h>
int main()
{
    setlocale(0, "ru");
    int x, y;
    bool k;
    std::cout << "Область ограничена по Ох от - беск-ти до -2. \nОграничения по Оу от 1 до беск-ти.\n";
    std::cout << "Введите значения х и у, чтобы узнать, попала ли точка в заданную область: ";
    std::cin >> x >> y;
    k = (x <= -2) && (y >= 1);
    if (k) {
        std::cout << "Введенная точка попадает в заданную область.";
    }
    else {
        if (x > -2 && y < 1) {
            std::cout << "\nКоординаты введенной точки находятся вне заданной области.";
            do {
                std::cout << "\nВведите значение x: ";
                std::cin >> x;
                std::cout << "\nВведите то же значение y: ";
                std::cin >> y;
            } while ((x > -2) || (y < 1));
            if (x <= -2 && y >= 1)
                std::cout << "\nВы попали в область.\n";
        }
        else if (x > -2) {
            std::cout << "\nКоордината х попадает за пределы заданной области.\n";
            do {
                std::cout << "\nВведите значение x: ";
                std::cin >> x;
                std::cout << "\nВведите то же значение y: ";
                std::cin >> y;
            } while ((x > -2) || (y < 1));
            if (x <= -2)
                std::cout << "\nВы попали в область.\n";
        }
        else if (y < 1) {
            std::cout << "\nКоордината у попадает за пределы заданной области.\n";
            do {
                std::cout << "\nВведите то же значение x: ";
                std::cin >> x;
                std::cout << "\nВведите значение y: ";
                std::cin >> y;
            } while ((x > -2) || (y < 1));
            if (y >= 1)
                std::cout << "\nВы попали в область.\n";
        }
    }
    _getch();
}